In [26]:
import pandas as pd
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                   'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                   'data2': range(3)})

In [27]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [28]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [29]:
pd.merge(df1, df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [30]:
df1.merge(df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [31]:
pd.merge(df1, df2, on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [32]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                   'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                   'data2': range(3)})

In [33]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [34]:
# left join with df1
pd.merge(df1, df2, how='left')

   data1 key  data2
0      0   b      1
1      1   b      1
2      2   a      0
3      3   c    NaN
4      4   a      0
5      5   a      0
6      6   b      1

In [35]:
# right join with df1
pd.merge(df1, df2, how='right')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0
6    NaN   d      2

In [36]:
# outer join with df1 and df2
pd.merge(df1, df2, how='outer')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0
6      3   c    NaN
7    NaN   d      2

In [50]:
# cartesian product with merging
pd.merge(df1, df2,on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [45]:
from pandas import DataFrame, merge
dff1 = DataFrame({'key':[1,1], 'col1':[1,2],'col2':[3,4]})
dff2 = DataFrame({'key':[1,1], 'col3':[5,6]})

merge(dff1, dff2,on='key')

   col1  col2  key  col3
0     1     3    1     5
1     1     3    1     6
2     2     4    1     5
3     2     4    1     6

In [49]:
merge(dff1, dff2, how='outer')

   col1  col2  key  col3
0     1     3    1     5
1     1     3    1     6
2     2     4    1     5
3     2     4    1     6

In [51]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                    'key2': ['one', 'two', 'one'],
                    'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                     'key2': ['one', 'one', 'one', 'two'],
                     'rval': [4, 5, 6, 7]})

In [52]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  foo  two     2   NaN
3  bar  one     3     6
4  bar  two   NaN     7

In [53]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  bar  one     3     6

In [54]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [55]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [57]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                     'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]},
                      index=['a', 'b'])

In [58]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [59]:
left2 = pd.DataFrame([[1,2], [3,4], [5,6]], index=['a', 'c', 'e'], columns=['Ohio', 'Nevada'])

In [60]:
right2 = pd.DataFrame([[7,8], [9,10], [11,12], [13, 14]],
                     index=['b', 'c', 'd', 'e'],
                     columns=['Missouri', 'Alabama'])

In [61]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a     1       2       NaN      NaN
b   NaN     NaN         7        8
c     3       4         9       10
d   NaN     NaN        11       12
e     5       6        13       14

In [63]:
left2.join(right2)

   Ohio  Nevada  Missouri  Alabama
a     1       2       NaN      NaN
c     3       4         9       10
e     5       6        13       14

In [64]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [65]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a     1       2       NaN      NaN
b   NaN     NaN         7        8
c     3       4         9       10
d   NaN     NaN        11       12
e     5       6        13       14

In [66]:
s1 = pd.Series([0,1], index = ['a', 'b'])
s2 = pd.Series([2, 3, 4], index = ['c', 'd', 'e'])
s3 = pd.Series([5,6], index = ['f', 'g'])

In [67]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [68]:
pd.concat([s1, s2, s3], axis=1)

    0   1   2
a   0 NaN NaN
b   1 NaN NaN
c NaN   2 NaN
d NaN   3 NaN
e NaN   4 NaN
f NaN NaN   5
g NaN NaN   6

In [70]:
s4 = pd.concat([s1 * 5, s3])

In [71]:
pd.concat([s1, s4], axis=1)

    0  1
a   0  0
b   1  5
f NaN  5
g NaN  6

In [72]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  5

In [74]:
import numpy as np
df1 = pd.DataFrame(np.random.randn(3,4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2,3), columns=['b', 'd', 'a'])

In [75]:
pd.concat([df1, df2])

          a         b         c         d
0 -0.919035 -0.332899 -0.360240  1.070196
1  1.016997  0.376425 -0.488171 -0.502443
2  0.023304 -0.898577 -0.114067 -0.322339
0 -0.600340 -0.455902       NaN  0.078305
1 -2.022182  1.450246       NaN  0.210867

In [76]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0 -0.919035 -0.332899 -0.360240  1.070196
1  1.016997  0.376425 -0.488171 -0.502443
2  0.023304 -0.898577 -0.114067 -0.322339
3 -0.600340 -0.455902       NaN  0.078305
4 -2.022182  1.450246       NaN  0.210867

In [77]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
             index=['f', 'e', 'd', 'c', 'b', 'a'])
b = pd.Series(np.arange(len(a), dtype=np.float64), 
             index=['f', 'e', 'd', 'c', 'b', 'a'])

In [78]:
print a
print b

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64
f    0
e    1
d    2
c    3
b    4
a    5
dtype: float64

In [79]:
c = pd.Series(np.where(pd.isnull(a), b, a))

In [80]:
print c

0    0.0
1    2.5
2    2.0
3    3.5
4    4.5
5    5.0
dtype: float64

In [81]:
df1 = pd.DataFrame({'a': [1., np.nan, 5.0, np.nan],
                   'b': [np.nan, 2., np.nan, 6.],
                   'c': range(2, 18, 4)})
print df1

    a   b   c
0   1 NaN   2
1 NaN   2   6
2   5 NaN  10
3 NaN   6  14

In [82]:
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
                   'b': [np.nan, 3., 4., 6., 8.]})
print df2

    a   b
0   5 NaN
1   4   3
2 NaN   4
3   3   6
4   7   8

In [84]:
df1.combine_first(df2)

   a   b   c
0  1 NaN   2
1  4   2   6
2  5   4  10
3  3   6  14
4  7   8 NaN

In [85]:
# stacking dataframes

data = pd.DataFrame(np.arange(6).reshape((2,3)),
                   index=pd.Index(['Ohio', 'Colorado'], name='state'),
                   columns=pd.Index(['one', 'two', 'three'], name='number'))
print data

# let's stack the data
result = data.stack()
print result

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5
state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [86]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [87]:
# how to unstack hierarchical data frames
df = pd.DataFrame({'left': result, 'right': result+5},
                 columns=pd.Index(['left', 'right'], name='side'))
print df
df.unstack('state')

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [88]:
df.unstack('state').stack('side')

state         Ohio  Colorado
number side
one    left      0         3
       right     5         8
two    left      1         4
       right     6         9
three  left      2         5
       right     7        10

In [89]:
# pivot long form of data to wide format

ldata = pd.read_csv('ldata.csv')
print ldata

        date       item     value
0  3/15/2013    realgdp  2704.000
1  3/15/2013  inflation     0.025
2  3/15/2013      unemp     0.035
3  3/15/2014    realgdp  2720.000
4  3/15/2014  inflation     0.021
5  3/15/2014      unemp     0.038
6  3/15/2015    realgdp  2721.000
7  3/15/2015  inflation     0.018
8  3/15/2015      unemp     0.034

In [91]:
pivoted = ldata.pivot('date', 'item', 'value')
print pivoted

item       inflation  realgdp  unemp
date
3/15/2013      0.025     2704  0.035
3/15/2014      0.021     2720  0.038
3/15/2015      0.018     2721  0.034

In [92]:
ldata['value2'] = np.random.randn(len(ldata))
print ldata

        date       item     value    value2
0  3/15/2013    realgdp  2704.000 -0.674217
1  3/15/2013  inflation     0.025 -0.873071
2  3/15/2013      unemp     0.035 -0.161619
3  3/15/2014    realgdp  2720.000  0.568397
4  3/15/2014  inflation     0.021  1.530882
5  3/15/2014      unemp     0.038  0.912941
6  3/15/2015    realgdp  2721.000 -0.328805
7  3/15/2015  inflation     0.018  1.338585
8  3/15/2015      unemp     0.034  0.835822

In [93]:
pivoted2 = ldata.pivot('date', 'item')
print pivoted2

              value                   value2
item      inflation realgdp  unemp inflation   realgdp     unemp
date
3/15/2013     0.025    2704  0.035 -0.873071 -0.674217 -0.161619
3/15/2014     0.021    2720  0.038  1.530882  0.568397  0.912941
3/15/2015     0.018    2721  0.034  1.338585 -0.328805  0.835822

In [94]:
ldata.set_index(['date', 'item'])

                        value    value2
date      item
3/15/2013 realgdp    2704.000 -0.674217
          inflation     0.025 -0.873071
          unemp         0.035 -0.161619
3/15/2014 realgdp    2720.000  0.568397
          inflation     0.021  1.530882
          unemp         0.038  0.912941
3/15/2015 realgdp    2721.000 -0.328805
          inflation     0.018  1.338585
          unemp         0.034  0.835822

In [95]:
ldata.set_index(['date', 'item']).unstack('item')

              value                   value2
item      inflation realgdp  unemp inflation   realgdp     unemp
date
3/15/2013     0.025    2704  0.035 -0.873071 -0.674217 -0.161619
3/15/2014     0.021    2720  0.038  1.530882  0.568397  0.912941
3/15/2015     0.018    2721  0.034  1.338585 -0.328805  0.835822

In [96]:
# removing duplicates from dataframe
data = pd.DataFrame({'k1': ['one']*3 + ['two']*4, 'k2': [1,1,2,3,3,4,4]})
print data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [97]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [98]:
data.drop_duplicates('k1')

    k1  k2
0  one   1
3  two   3

In [99]:
data.drop_duplicates('k2')

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [100]:
data['v1'] = range(7)
print data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [101]:
data.drop_duplicates('k1')

    k1  k2  v1
0  one   1   0
3  two   3   3

In [102]:
data.drop_duplicates('k2')

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [103]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

In [104]:
data.drop_duplicates(['k1', 'k2'], keep='first')

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [116]:
# Create two lists
i = pd.Series({'a': [1,2,3,4,5]})
j = pd.Series({'b': [1,2,3,4,5]})

print i

a    [1, 2, 3, 4, 5]
dtype: object